added the femur part mechanism and updated the system architecture
